/******************************************************************************

Подвиг 9. Вводится строка, состоящая из слов, разделенных пробелом. 
Необходимо подсчитать число слов в этой строке 
и результат (число) отобразить на экране.

*******************************************************************************/
#include <stdio.h>

int main() {
    char str[30];
    int x = 1;
    scanf("%[^\n]", str);
    
    for( int i = 0; str[i] != '\0'; i++){
        if (str[i] == ' '){
            x++;
        }
    }
    printf("%d", x);
    
    return 0;
}