/******************************************************************************

Подвиг 9. Вводятся два слова (через пробел в одной строке). 
Длина первого слова меньше второго. Необходимо обрезать второе слово 
до длины первого и отобразить обрезанное слово на экране.

*******************************************************************************/
#include <stdio.h>

int main() {
    char w1[15], w2[15];
    scanf("%s %s", w1, w2);

    w2[strlen(w1)] = '\0';

    printf(w2);

    return 0;
}

