/******************************************************************************

Подвиг 5. Напишите программу отображения последних трех 
символов из введенной строки. Будем полагать, 
что строка гарантированно длиной не менее трех символов.

*******************************************************************************/
#include <stdio.h>

int main() {
    char str[15];
    scanf("%s", str);
    
    int len = strlen(str);
    
    if (len > 0) {
        printf("%c%c%c", str[len-3], str[len-2], str[len-1]);
    }
        
    return 0;
}

