/******************************************************************************

Подвиг 7. Вводятся две строки (каждая с новой строчки). Из первой 
строки выделить все символы с четными индексами, а из второй - с нечетными. 
Объединить строки через пробел и вывести на экран.

*******************************************************************************/
#include <stdio.h>

int main() {
    char s1[15], s2[15];
    char res[15];
    int i, j;
    
    scanf("%s", s1);
    scanf("%s", s2);
    
    j = 0;
    for (i = 0; s1[i] != '\0'; i += 2) {
        res[j++] = s1[i];
    }
    res[j++] = ' ';

    for (i = 1; s2[i] != '\0'; i += 2) {
        res[j++] = s2[i];
    }
    res[j] = '\0'; 

    printf(res);

    return 0;
}

