/******************************************************************************

Подвиг 1. Напишите программу ввода строки и отображения на экране 
ее первого и последнего символа в виде одной строки.

*******************************************************************************/
#include <stdio.h>

int main() {
    char str[30];
    
    scanf("%[^\n]", str);

    int len = strlen(str);

    if (len > 0) {
        // Вывод первого и последнего символа
        printf("%c%c", str[0], str[len - 1]);
    } else {
        printf("Строка пустая\n");
    }

    return 0;
}

