/******************************************************************************

Подвиг 5. Напишите программу ввода двух строк (каждая вводится с новой строки) 
и их объединения в одну строку через пробел. Результат выведите на экран.

*******************************************************************************/
#include <stdio.h>
#include <string.h>

int main() {
    char str1[100], str2[100];
    fgets(str1, sizeof(str1), stdin);
    fgets(str2, sizeof(str2), stdin);
    
    str1[strcspn(str1, "\n")] = 0;
    str2[strcspn(str2, "\n")] = 0;
    
    strcat(str1, " ");
    strcat(str1, str2);

    printf(str1);

    return 0;
}