/******************************************************************************

Подвиг 9. Написать программу ввода строки и формирования новой строчки вида: 
"Строка: <введенная строка>. Длина: <длина строки>". 
Результат сформированной строки вывести на экран.

P. S. В программе F-строки не использовать.

*******************************************************************************/
#include <stdio.h>

int main() {
    char str[30];
    scanf("%[^\n]", str); // Чтение строки с пробелами

    int length = strlen(str);

    printf("Строка: %s. Длина: %d\n", str, length);

    return 0;
}
