/******************************************************************************

Вводится слово. Необходимо первую букву этого слова сделать заглавной, 
а остальные - малыми. Результат отобразить на экране.

*******************************************************************************/
#include <stdio.h>
#include <ctype.h>

int main() {
    char str[15];
    scanf("%s", str);
    
    str[0] = toupper(str[0]);
    
    for(int i = 1; str[i] != '\0'; i++) {
        str[i] = tolower(str[i]);
    }
    
    printf("%s", str);
    
    return 0;
}
