/******************************************************************************

Напишите код, который к строке str, включающей имя добавляет столько 
восклицательных знаков, чтобы суммарная длина строки была равна 20 символам.

*******************************************************************************/
#include <stdio.h>
#include <string.h>

int main() {
    char str[100];
    scanf("%s", str);

    int len = strlen(str);

    int count = 20 - len;

    for (int i = len; i < 20; i++) {
        str[i] = '!';
    }
    str[20] = '\0';

    printf("%s", str);

    return 0;
}
