/******************************************************************************

Подвиг 6. Вводится строка. С помощью метода String.find 
найдите в этой строке индекс первого вхождения фрагмента "ra". 
Полученное число выведите на экран.

*******************************************************************************/
#include <stdio.h>
#include <string.h>

int main() {
    char str[30];
    char *ptr;
    
    scanf("%[^\n]", str);
    
    ptr = strstr(str, "ra");

    if (ptr != NULL) {
        printf("%ld", ptr - str);
    }

    return 0;
}