/******************************************************************************

Подвиг 6. Напишите программу отображения всех символов 
с нечетными индексами из введенной строки.

*******************************************************************************/
#include <stdio.h>

int main() {
    char str[15];
    scanf("%s", str);
    
    int len = strlen(str);
    
    for (int i = 1; i < len; i += 2) {
        printf("%c", str[i]);
    }
    printf("\n");
    
    return 0;
}
